gmtcontrol/nuttx/arch/arm/include/ra6m5/r7fa6m5bx_irq.h
#ifdef CONFIG_RA6M5_SCI4
#  define RA6M5_IRQ_SCI4_RXI    (RA6M5_SCI4_IRQBASE + RA6M5_RXI_IRQ_OFFSET) /* SCI4 Receive data full interrupt */
#  define RA6M5_IRQ_SCI4_TXI    (RA6M5_SCI4_IRQBASE + RA6M5_TXI_IRQ_OFFSET) /* SCI4 Transmit data empty interrupt */
#  define RA6M5_IRQ_SCI4_TEI    (RA6M5_SCI4_IRQBASE + RA6M5_TEI_IRQ_OFFSET) /* SCI4 Transmit end interrupt */
#  define RA6M5_IRQ_SCI4_ERI    (RA6M5_SCI4_IRQBASE + RA6M5_ERI_IRQ_OFFSET) /* SCI4 Receive error interrupt */
#  define RA6M5_SCI5_IRQBASE    (RA6M5_SCI4_IRQBASE + RA6M5_SCI_NIRQS)
#else 
#  define RA6M5_SCI5_IRQBASE    (RA6M5_SCI4_IRQBASE)
#endif

#ifdef CONFIG_RA6M5_SCI5
#  define RA6M5_IRQ_SCI5_RXI    (RA6M5_SCI5_IRQBASE + RA6M5_RXI_IRQ_OFFSET) /* SCI5 Receive data full interrupt */
#  define RA6M5_IRQ_SCI5_TXI    (RA6M5_SCI5_IRQBASE + RA6M5_TXI_IRQ_OFFSET) /* SCI5 Transmit data empty interrupt */
#  define RA6M5_IRQ_SCI5_TEI    (RA6M5_SCI5_IRQBASE + RA6M5_TEI_IRQ_OFFSET) /* SCI5 Transmit end interrupt */
#  define RA6M5_IRQ_SCI5_ERI    (RA6M5_SCI5_IRQBASE + RA6M5_ERI_IRQ_OFFSET) /* SCI5 Receive error interrupt */
#  define RA6M5_SCI6_IRQBASE    (RA6M5_SCI5_IRQBASE + RA6M5_SCI_NIRQS)
#else 
#  define RA6M5_SCI6_IRQBASE    (RA6M5_SCI5_IRQBASE)
#endif

#ifdef CONFIG_RA6M5_SCI6
#  define RA6M5_IRQ_SCI6_RXI    (RA6M5_SCI6_IRQBASE + RA6M5_RXI_IRQ_OFFSET) /* SCI6 Receive data full interrupt */
#  define RA6M5_IRQ_SCI6_TXI    (RA6M5_SCI6_IRQBASE + RA6M5_TXI_IRQ_OFFSET) /* SCI6 Transmit data empty interrupt */
#  define RA6M5_IRQ_SCI6_TEI    (RA6M5_SCI6_IRQBASE + RA6M5_TEI_IRQ_OFFSET) /* SCI6 Transmit end interrupt */
#  define RA6M5_IRQ_SCI6_ERI    (RA6M5_SCI6_IRQBASE + RA6M5_ERI_IRQ_OFFSET) /* SCI6 Receive error interrupt */
#  define RA6M5_SCI7_IRQBASE    (RA6M5_SCI6_IRQBASE + RA6M5_SCI_NIRQS)
#else 
#  define RA6M5_SCI7_IRQBASE    (RA6M5_SCI6_IRQBASE)
#endif

#ifdef CONFIG_RA6M5_SCI7
#  define RA6M5_IRQ_SCI7_RXI    (RA6M5_SCI7_IRQBASE + RA6M5_RXI_IRQ_OFFSET) /* SCI7 Receive data full interrupt */
#  define RA6M5_IRQ_SCI7_TXI    (RA6M5_SCI7_IRQBASE + RA6M5_TXI_IRQ_OFFSET) /* SCI7 Transmit data empty interrupt */
#  define RA6M5_IRQ_SCI7_TEI    (RA6M5_SCI7_IRQBASE + RA6M5_TEI_IRQ_OFFSET) /* SCI7 Transmit end interrupt */
#  define RA6M5_IRQ_SCI7_ERI    (RA6M5_SCI7_IRQBASE + RA6M5_ERI_IRQ_OFFSET) /* SCI7 Receive error interrupt */
#  define RA6M5_SCI8_IRQBASE    (RA6M5_SCI7_IRQBASE + RA6M5_SCI_NIRQS)
#else 
#  define RA6M5_SCI8_IRQBASE    (RA6M5_SCI7_IRQBASE)
#endif

#ifdef CONFIG_RA6M5_SCI8
#  define RA6M5_IRQ_SCI8_RXI    (RA6M5_SCI8_IRQBASE + RA6M5_RXI_IRQ_OFFSET) /* SCI8 Receive data full interrupt */
#  define RA6M5_IRQ_SCI8_TXI    (RA6M5_SCI8_IRQBASE + RA6M5_TXI_IRQ_OFFSET) /* SCI8 Transmit data empty interrupt */
#  define RA6M5_IRQ_SCI8_TEI    (RA6M5_SCI8_IRQBASE + RA6M5_TEI_IRQ_OFFSET) /* SCI8 Transmit end interrupt */
#  define RA6M5_IRQ_SCI8_ERI    (RA6M5_SCI8_IRQBASE + RA6M5_ERI_IRQ_OFFSET) /* SCI8 Receive error interrupt */
#  define RA6M5_SCI9_IRQBASE    (RA6M5_SCI8_IRQBASE + RA6M5_SCI_NIRQS)
#else 
#  define RA6M5_SCI9_IRQBASE    (RA6M5_SCI8_IRQBASE)
#endif

#ifdef CONFIG_RA6M5_SCI9
#  define RA6M5_IRQ_SCI9_RXI    (RA6M5_SCI9_IRQBASE + RA6M5_RXI_IRQ_OFFSET) /* SCI9 Receive data full interrupt */
#  define RA6M5_IRQ_SCI9_TXI    (RA6M5_SCI9_IRQBASE + RA6M5_TXI_IRQ_OFFSET) /* SCI9 Transmit data empty interrupt */
#  define RA6M5_IRQ_SCI9_TEI    (RA6M5_SCI9_IRQBASE + RA6M5_TEI_IRQ_OFFSET) /* SCI9 Transmit end interrupt */
#  define RA6M5_IRQ_SCI9_ERI    (RA6M5_SCI9_IRQBASE + RA6M5_ERI_IRQ_OFFSET) /* SCI9 Receive error interrupt */
#  define RA6M5_SPI0_IRQBASE    (RA6M5_SCI9_IRQBASE + RA6M5_SCI_NIRQS)
#else 
#  define RA6M5_SPI0_IRQBASE    (RA6M5_SCI9_IRQBASE)
#endif

#ifdef CONFIG_RA6M5_SPI0
#  define RA6M5_IRQ_SPI0_RXI    (RA6M5_SPI0_IRQBASE + RA6M5_RXI_IRQ_OFFSET) /* SPI0 Receive data full interrupt */
#  define RA6M5_IRQ_SPI0_TXI    (RA6M5_SPI0_IRQBASE + RA6M5_TXI_IRQ_OFFSET) /* SPI0 Transmit data empty interrupt */
#  define RA6M5_IRQ_SPI0_TEI    (RA6M5_SPI0_IRQBASE + RA6M5_TEI_IRQ_OFFSET) /* SPI0 Transmit end interrupt */
#  define RA6M5_IRQ_SPI0_ERI    (RA6M5_SPI0_IRQBASE + RA6M5_ERI_IRQ_OFFSET) /* SPI0 Receive error interrupt */
#  define RA6M5_SPI1_IRQBASE    (RA6M5_SPI0_IRQBASE + RA6M5_SCI_NIRQS)
#else 
#  define RA6M5_SPI1_IRQBASE    (RA6M5_SPI0_IRQBASE)
#endif

#ifdef CONFIG_RA6M5_SPI1
#  define RA6M5_IRQ_SPI1_RXI    (RA6M5_SPI1_IRQBASE + RA6M5_RXI_IRQ_OFFSET) /* SPI1 Receive data full interrupt */
#  define RA6M5_IRQ_SPI1_TXI    (RA6M5_SPI1_IRQBASE + RA6M5_TXI_IRQ_OFFSET) /* SPI1 Transmit data empty interrupt */
#  define RA6M5_IRQ_SPI1_TEI    (RA6M5_SPI1_IRQBASE + RA6M5_TEI_IRQ_OFFSET) /* SPI1 Transmit end interrupt */
#  define RA6M5_IRQ_SPI1_ERI    (RA6M5_SPI1_IRQBASE + RA6M5_ERI_IRQ_OFFSET) /* SPI1 Receive error interrupt */
#  define RA6M5_IIC0_IRQBASE    (RA6M5_SPI1_IRQBASE + RA6M5_SCI_NIRQS)
#else 
#  define RA6M5_IIC0_IRQBASE    (RA6M5_SPI1_IRQBASE)
#endif

#ifdef CONFIG_RA6M5_IIC0
#  define RA6M5_IRQ_IIC0_RXI    (RA6M5_IIC0_IRQBASE + RA6M5_RXI_IRQ_OFFSET) /* IIC0 Receive data full interrupt */
#  define RA6M5_IRQ_IIC0_TXI    (RA6M5_IIC0_IRQBASE + RA6M5_TXI_IRQ_OFFSET) /* IIC0 Transmit data empty interrupt */
#  define RA6M5_IRQ_IIC0_TEI    (RA6M5_IIC0_IRQBASE + RA6M5_TEI_IRQ_OFFSET) /* IIC0 Transmit end interrupt */
#  define RA6M5_IRQ_IIC0_ERI    (RA6M5_IIC0_IRQBASE + RA6M5_ERI_IRQ_OFFSET) /* IIC0 Receive error interrupt */
#  define RA6M5_IIC1_IRQBASE    (RA6M5_IIC0_IRQBASE + RA6M5_SCI_NIRQS)
#else 
#  define RA6M5_IIC1_IRQBASE    (RA6M5_IIC0_IRQBASE)
#endif

#ifdef CONFIG_RA6M5_IIC1
#  define RA6M5_IRQ_IIC1_RXI    (RA6M5_IIC1_IRQBASE + RA6M5_RXI_IRQ_OFFSET) /* IIC1 Receive data full interrupt */
#  define RA6M5_IRQ_IIC1_TXI    (RA6M5_IIC1_IRQBASE + RA6M5_TXI_IRQ_OFFSET) /* IIC1 Transmit data empty interrupt */
#  define RA6M5_IRQ_IIC1_TEI    (RA6M5_IIC1_IRQBASE + RA6M5_TEI_IRQ_OFFSET) /* IIC1 Transmit end interrupt */
#  define RA6M5_IRQ_IIC1_ERI    (RA6M5_IIC1_IRQBASE + RA6M5_ERI_IRQ_OFFSET) /* IIC1 Receive error interrupt */
#  define RA6M5_IIC2_IRQBASE    (RA6M5_IIC1_IRQBASE + RA6M5_SCI_NIRQS)
#else 
#  define RA6M5_IIC2_IRQBASE    (RA6M5_IIC1_IRQBASE)
#endif

#ifdef CONFIG_RA6M5_IIC2
#  define RA6M5_IRQ_IIC2_RXI    (RA6M5_IIC2_IRQBASE + RA6M5_RXI_IRQ_OFFSET) /* IIC2 Receive data full interrupt */
#  define RA6M5_IRQ_IIC2_TXI    (RA6M5_IIC2_IRQBASE + RA6M5_TXI_IRQ_OFFSET) /* IIC2 Transmit data empty interrupt */
#  define RA6M5_IRQ_IIC2_TEI    (RA6M5_IIC2_IRQBASE + RA6M5_TEI_IRQ_OFFSET) /* IIC2 Transmit end interrupt */
#  define RA6M5_IRQ_IIC2_ERI    (RA6M5_IIC2_IRQBASE + RA6M5_ERI_IRQ_OFFSET) /* IIC2 Receive error interrupt */
#  define RA6M5_DTC_IRQBASE     (RA6M5_IIC2_IRQBASE + RA6M5_SCI_NIRQS)
#else 
#  define RA6M5_DTC_IRQBASE     (RA6M5_IIC2_IRQBASE)
#endif

#ifdef CONFIG_RA6M5_DTC
#  define RA6M5_IRQ_DTC_COMP    (RA6M5_DTC_IRQBASE + 0) /* DTC transfer complete interrupt */
#  define RA6M5_IRQ_DTC_END     (RA6M5_DTC_IRQBASE + 1) /* DTC transfer end interrupt */
#  define RA6M5_RTC_IRQBASE     (RA6M5_DTC_IRQBASE + 2)
#else 
#  define RA6M5_RTC_IRQBASE     (RA6M5_DTC_IRQBASE)
#endif

#ifdef CONFIG_RA6M5_RTC
#  define RA6M5_IRQ_RTC_ALARM   (RA6M5_RTC_IRQBASE + 0) /* RTC Alarm interrupt */
#  define RA6M5_IRQ_RTC_PERIOD  (RA6M5_RTC_IRQBASE + 1) /* RTC Periodic interrupt */
#  define RA6M5_IRQ_RTC_CARRY   (RA6M5_RTC_IRQBASE + 2) /* RTC Carry interrupt */
#  define RA6M5_USBFS_IRQBASE   (RA6M5_RTC_IRQBASE + 3)
#else 
#  define RA6M5_USBFS_IRQBASE   (RA6M5_RTC_IRQBASE)
#endif

#ifdef CONFIG_RA6M5_USBFS
#  ifdef CONFIG_USBDEV_DMA
#    define RA6M5_IRQ_USBFS_FIFO0   (RA6M5_USBFS_IRQBASE + 0)   /* DMA transfer request 0 */
#    define RA6M5_IRQ_USBFS_FIFO1   (RA6M5_USBFS_IRQBASE + 1)   /* DMA transfer request 1 */
#    define RA6M5_IRQ_USBFS_INT     (RA6M5_USBFS_IRQBASE + 2)   /* USBFS interrupt */
#    define RA6M5_IRQ_USBFS_RSM     (RA6M5_USBFS_IRQBASE + 3)   /* USBFS resume interrupt */
#    define RA6M5_USBHS_IRQBASE     (RA6M5_USBFS_IRQBASE + 4)
#  else
#    define RA6M5_IRQ_USBFS_INT     (RA6M5_USBFS_IRQBASE + 0)   /* USBFS interrupt */
#    define RA6M5_IRQ_USBFS_RSM     (RA6M5_USBFS_IRQBASE + 1)   /* USBFS resume interrupt */
#    define RA6M5_USBHS_IRQBASE     (RA6M5_USBFS_IRQBASE + 2)
#  endif
#else 
#  define RA6M5_USBHS_IRQBASE       (RA6M5_USBFS_IRQBASE)
#endif

